ETL/Catalogs/СтатьиБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СтатьиБюджетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АналитикаПоЭлементамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементЗатратОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоЭлементамДоходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДоходовОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоТоварыПродукцияУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварыПродукцияУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварыПродукцияУслугиОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКонтрагентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентыОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКомпаниям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпанииОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоПериодам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоСценариям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарииОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоРынкамСбыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РынокСбытаОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВидамПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПерсонала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПерсоналаОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоТипамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗатратОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКаналамПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналыПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналыПродажОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВидамДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДвижения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДвижения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДвиженияОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКатегориямАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияАктива1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияАктиваОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияДтКт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименимостьКФактическимДанным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСтатейCFI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВУправленческуюОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлементыДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПланСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КатегорииАктивов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаCFI</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСправочника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыДвижения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Знак</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДвижения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДвиженияДтКт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/СтатьиБюджетов/Ext/ObjectModule.bsl
// Процедура генерирует код перемещаемого элемента (группы) справочника,
// а также код расположенного рядом элемента при интерактивном перемещении
// элемента в форме списка справочника.
// Записывает переставляемые элементы с измененными кодами.
// В случае сдвига группы элементов также изменяет коды вложенных в группу
// элементов.
//
// Параметры
// Направление – число – напрвление сдвига элемента,
// принимает значения:
// 1 - при сдвиге вниз;
// -1 - при сдвиге вверх.
//
Процедура ИзменитьКод(Направление) Экспорт
	
	//#Если Клиент Тогда
		
		ТекущийКод = Код;
		
		СписокКодов = Новый СписокЗначений;
		
		СтатьиБюджета = Справочники.СтатьиБюджетов;
		ВыборкаСтроки = СтатьиБюджета.Выбрать(Родитель, Владелец, , "Код Убыв");
		
		Пока ВыборкаСтроки.Следующий() Цикл
			СписокКодов.Добавить(ВыборкаСтроки.Код);
		КонецЦикла;
		
		Если СписокКодов.Количество() < 2 Тогда
			// На данном уровне имеется только один элемент или группа справочника.
			// Игнорируем действие пользователя.
			
			Возврат;
		КонецЕсли;
		
		ПорядковыйНомер = СписокКодов.Индекс(СписокКодов.НайтиПоЗначению(ТекущийКод));
		
		Если (ПорядковыйНомер = 0) И (Направление < 0) Тогда
			
			// Попытка перемещения первого по порядку элемента вверх.
			ИндексЭлементаЗамены = СписокКодов.Количество() - 1;
			
		ИначеЕсли (ПорядковыйНомер = СписокКодов.Количество() - 1) И (Направление > 0) Тогда
			
			// Попытка перемещения последнего по порядку элемента вниз.
			ИндексЭлементаЗамены = 0;
			
		Иначе
			
			// в иных случаях
			ИндексЭлементаЗамены = ПорядковыйНомер + Направление;
			
		КонецЕсли;
		
		КодЭлементаЗамены = СписокКодов.Получить(ИндексЭлементаЗамены).Значение;
		
		ЭлементЗаменыСсылка = СтатьиБюджета.НайтиПоКоду(КодЭлементаЗамены,,Родитель, Владелец);
		Если ЭлементЗаменыСсылка <> СтатьиБюджета.ПустаяСсылка() Тогда
			
			Попытка
				
				// Открываем транзакцию
				НачатьТранзакцию();
				
				// Промежуточная запись текущего элемента с уникальным кодом
				ЭтотОбъект.Код="&&$##";
				ЭтотОбъект.Записать();
				
				// записываем соседний элемент с кодом текущего
				ЭлементЗамены= ЭлементЗаменыСсылка.ПолучитьОбъект();
				ПредыдущийКод=ЭлементЗамены.Код;
				ЭлементЗамены.Код = ТекущийКод;
				ЭлементЗамены.Записать();
				
				// записываем текущий элемент с кодом соседнего
				ЭтотОбъект.Код = ПредыдущийКод;
				ЭтотОбъект.Записать();
				
				// Завершаем транзакцию
				ЗафиксироватьТранзакцию();
				
			Исключение
				Сообщить("Не удалось записать элемент справочника:
				|" + ОписаниеОшибки());
				
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
		
	//#КонецЕсли
	
КонецПроцедуры // ИзменитьКод()
Процедура ПередЗаписью(Отказ) 
	//Если ИмяПользователя()<>"AMD_Partner" Тогда	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтатьиБюджетовСчета.Счет КАК Счет,
		               |	СтатьиБюджетовСчета.Ссылка КАК Ссылка,
		               |	СтатьиБюджетовСчета.Ссылка.Код КАК Код
		               |ИЗ
		               |	Справочник.СтатьиБюджетов.Счета КАК СтатьиБюджетовСчета
		               |ГДЕ
		               |	СтатьиБюджетовСчета.Ссылка <> &Ссылка
		               |	И СтатьиБюджетовСчета.Ссылка.НеИспользуется = ЛОЖЬ
		               |	И СтатьиБюджетовСчета.Ссылка.Владелец = &Владелец
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СтатьиБюджетовСчета.Ссылка,
		               |	СтатьиБюджетовСчета.Ссылка.Код,
		               |	СтатьиБюджетовСчета.Счет";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Владелец",Владелец);
		
		ТЗсчета = Запрос.Выполнить().Выгрузить();
		
		
		
		Если Не ЭтоГруппа Тогда
			Разделитель = "";
			Сч = "";
			для каждого стр из Счета Цикл
				НайденСчет = ТЗсчета.Найти(стр.Счет,"Счет");
				Если НайденСчет<>Неопределено Тогда
					Сообщить("Счет " + Строка(стр.Счет) +" уже указан в другой статье ("+Строка(НайденСчет.Код)+")"+Строка(НайденСчет.Ссылка));
					Отказ = Истина;
				КонецЕсли;	
				
				Сч = Сч+""+Строка(стр.Счет.КодСправочника)+", ";
			КонецЦикла;	
			СписокСчетов = Сч;
		КонецЕсли;
	//КонецЕсли;
	СписокСтатейCFI = "";
	для каждого стр из НастройкаCFI Цикл
		СписокСтатейCFI = СписокСтатейCFI+""+Строка(СокрЛП(стр.ЭлементСправочника.КодСправочника))+"; ";
	КонецЦикла;	
	
КонецПроцедуры
